In [8]:
import requests
import pandas as pd
import uuid

# SQLITE3 to manage a very simple database
# https://www.sqlite.org/
import sqlite3

In [9]:
# Create if not exists
# or connect to the SQLITE3 database
conn = sqlite3.connect('sql-murder-mystery.db')

# Generate a cursor to access to the database
c = conn.cursor()

In [10]:
tables_q = 'SELECT name from sqlite_master where type= "table"'
c.execute(tables_q)
tables = c.fetchall()

In [11]:
tables

[('crime_scene_report',),
 ('drivers_license',),
 ('person',),
 ('facebook_event_checkin',),
 ('interview',),
 ('get_fit_now_member',),
 ('get_fit_now_check_in',),
 ('income',),
 ('solution',)]

In [5]:
#for table in tables:
#    #print(table[0])
#    table_name = table[0]
#    df = pd.read_sql_query("SELECT * FROM {0}".format(table_name), conn)
#    df.to_csv("{0}.csv".format(table_name, sep = ",", ), index = False)

In [14]:
interview_df = pd.read_sql_query("SELECT * FROM interview", conn)
person_df = pd.read_sql_query("SELECT * FROM person", conn)

In [16]:
crime_scene_report_df = pd.read_sql_query("SELECT * FROM crime_scene_report", conn)
drivers_license_df = pd.read_sql_query("SELECT * FROM drivers_license", conn)
person_df = pd.read_sql_query("SELECT * FROM person", conn)
facebook_event_checkin_df = pd.read_sql_query("SELECT * FROM facebook_event_checkin", conn)
interview_df = pd.read_sql_query("SELECT * FROM interview", conn)
get_fit_now_member_df = pd.read_sql_query("SELECT * FROM get_fit_now_member", conn)
get_fit_now_check_in_df = pd.read_sql_query("SELECT * FROM get_fit_now_check_in", conn)
income_df = pd.read_sql_query("SELECT * FROM income", conn)
solution_df = pd.read_sql_query("SELECT * FROM solution", conn)

In [21]:
crime_scene_report_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1228 entries, 0 to 1227
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1228 non-null   int64
 1   type         1228 non-null   object
 2   description  1228 non-null   object
 3   city         1228 non-null   object
dtypes: int64(1), object(3)
memory usage: 38.5+ KB

In [17]:
crime_scene_report_df.head()

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City

In [31]:
pd.options.display.max_colwidth = None

m = crime_scene_report_df["type"] == 'murder'
c = crime_scene_report_df["city"] == 'SQL City'
d = crime_scene_report_df["date"] == 20180115

print(crime_scene_report_df[(m) & (c) & (d)])

          date    type  \
1227  20180115  murder

                                                                                                                                                                                    description  \
1227  Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".

          city
1227  SQL City

In [15]:
person_df.head()

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684

4919